
### Brief
| Check                      | Status                                                     |
| -------------------------- | ---------------------------------------------------------- |
| Terraform Format and Style | ✅      |
| Terraform Initialization   | ✅     |
| Terraform Validation       | ✅ |
| Terraform Plan             | ✅     |

<details><summary>Verbose Output</summary>

### Formatter Output
```
-
```

### Initialization Output
```
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of yandex-cloud/yandex from the dependency lock file
- Installing integrations/github v6.3.0...
- Installed integrations/github v6.3.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing yandex-cloud/yandex v0.129.0...
- Installed yandex-cloud/yandex v0.129.0 (self-signed, key ID E40F590B50BB8E40)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

```
-
```

### Validation Output
```
Success! The configuration is valid.


```

```
-
```

### Plan
```
yandex_container_registry.default: Refreshing state... [id=crpqjebug5o43oc5pfh2]
yandex_iam_service_account.container_registry: Refreshing state... [id=aje1ffo84q0g7pj8u6cs]
yandex_iam_service_account.deploy: Refreshing state... [id=ajevo27uqujvgf7q0ka4]
yandex_iam_service_account_key.container_registry_key: Refreshing state... [id=aje42c8d8fc041i4em0f]
github_actions_secret.registry_key: Refreshing state... [id=sleeping-bag-locator:YANDEX_CLOUD_REGISTRY_KEY]
data.yandex_container_repository.api: Reading...
yandex_container_registry_iam_binding.pusher: Refreshing state... [id=crpqjebug5o43oc5pfh2/container-registry.images.pusher]
yandex_container_registry_iam_binding.puller: Refreshing state... [id=crpqjebug5o43oc5pfh2/container-registry.images.puller]
github_actions_variable.registry_id: Refreshing state... [id=sleeping-bag-locator:YANDEX_CLOUD_REGISTRY_ID]
data.yandex_container_repository.api: Read complete after 1s [id=crp034nvo5fmfsa31cj1]
yandex_container_repository_lifecycle_policy.api: Refreshing state... [id=crp9iljnvljlmit8bics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_variable.deploy_service_acount_id will be created
  + resource "github_actions_variable" "deploy_service_acount_id" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "sleeping-bag-locator"
      + updated_at    = (known after apply)
      + value         = "ajevo27uqujvgf7q0ka4"
      + variable_name = "YANDEX_CLOUD_DEPLOY_SERVICE_ACCOUNT_ID"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - deploy_service_acount_id = "ajevo27uqujvgf7q0ka4" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

```
-
```
</details>

*Pusher: @ysignat*
*Action: `pull_request`* 
*Working Directory: `infra/`* 
*Workflow: `Pull request checks for infrastructure deployment`*
